# 4.9 Intro to Data Visualization in Python - Part I

###  Import libraries

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

### Import Data

In [2]:
#Set path

path = r"C:\Users\marce\Documents\Instacart Basket Analysis"

In [3]:
# Import customers.csv

df= pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

## 4. Data Wrangling

In [4]:
df.shape

(206209, 10)

In [5]:
# Rename columns : 'First Name', 'Surnam', 'Gender', 'STATE', 'Age', 'n_dependants', 'fam_status'

In [6]:
df.rename (columns = {'First Name' : 'first_name','Surnam' : 'last_name', 'Gender' : 'gender', 'STATE' : 'state', 'Age': 'age', 'n_dependants' : 'dependants_number', 'fam_status' : 'family_status'}, inplace = True)

In [7]:
df.head(15)

,user_id,first_name,last_name,gender,state,age,date_joined,dependants_number,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072
10,26441,Gloria,Stafford,Female,Nevada,19,1/1/2017,2,living with parents and siblings,43443
11,33835,Roger,Casey,Male,Nebraska,45,1/1/2017,2,married,47988
12,75032,Cynthia,Mcdaniel,Female,Georgia,75,1/1/2017,1,married,57835
13,51,Stephanie,Jensen,Female,Wyoming,37,1/1/2017,1,married,71190
14,516,Peter,Hunt,Male,Colorado,51,1/1/2017,2,married,146559

# 5. Data Quality

### Basic Info

In [8]:
df.shape

(206209, 10)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   user_id            206209 non-null  int64
 1   first_name         194950 non-null  object
 2   last_name          206209 non-null  object
 3   gender             206209 non-null  object
 4   state              206209 non-null  object
 5   age                206209 non-null  int64
 6   date_joined        206209 non-null  object
 7   dependants_number  206209 non-null  int64
 8   family_status      206209 non-null  object
 9   income             206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [10]:
df.describe()

             user_id            age  dependants_number         income
count  206209.000000  206209.000000      206209.000000  206209.000000
mean   103105.000000      49.501646           1.499823   94632.852548
std     59527.555167      18.480962           1.118433   42473.786988
min         1.000000      18.000000           0.000000   25903.000000
25%     51553.000000      33.000000           0.000000   59874.000000
50%    103105.000000      49.000000           1.000000   93547.000000
75%    154657.000000      66.000000           3.000000  124244.000000
max    206209.000000      81.000000           3.000000  593901.000000

In [11]:
# There are 206209 customers with age between 18 and 81 and with large differences in incomes.

### Mixed types

In [12]:
# Check for mixed types
for col in df.columns.tolist():
  weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
            print (col)
            print (len(df[weird]))

first_name
11259

In [13]:
# Note: There are 11259 mixed type values in 'first_name' column

### Missing values

In [14]:
# Finding missing values 

df.isnull().sum()

user_id                  0
first_name           11259
last_name                0
gender                   0
state                    0
age                      0
date_joined              0
dependants_number        0
family_status            0
income                   0
dtype: int64

In [15]:
# Create a new data frame containing missing values

df_nan =  df[df['first_name'].isnull()==True]

In [16]:
df_nan

,user_id,first_name,last_name,gender,state,age,date_joined,dependants_number,family_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

### Duplicates

In [17]:
# Create a new subset with duplicates

df_duplicates = df[df.duplicated()]

In [18]:
df_duplicates

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, dependants_number, family_status, income]
Index: []

#### No duplicates detected

### Data Wrangling II

In [19]:
# Remove columns that don't add anything to our analysis

df_customers = df.drop(columns = ['first_name', 'last_name'])

In [20]:
# Check for mixed types
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
            print (col)
            print (len(df_customers[weird]))

In [21]:
# Finding missing values 

df_customers.isnull().sum()

user_id              0
gender               0
state                0
age                  0
date_joined          0
dependants_number    0
family_status        0
income               0
dtype: int64

In [22]:
df_customers.shape

(206209, 8)

In [23]:
# Change datatype for a variables to reduce the memory space

df_customers['user_id'] = df['user_id'].astype('int32')
df_customers['age'] = df['age'].astype('int8')
df_customers['dependants_number'] = df['dependants_number'].astype('int8')

In [24]:
df_customers.dtypes

user_id               int32
gender               object
state                object
age                    int8
date_joined          object
dependants_number      int8
family_status        object
income                int64
dtype: object

### Combining Data

In [25]:
path = r"C:\Users\marce\Documents\Instacart Basket Analysis"

In [26]:
# Importing 'orders_products_merged. pkl'via pandas.pkl and os.path.join

df_orders_products_merged = pd.read_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_merge_3.pkl'))

In [31]:
# Merging datasets

df_ords_prods_custm = pd.merge(df_orders_products_merged, df_customers, on = 'user_id', how = 'outer', indicator ='exists')

In [32]:
# Checking output

df_ords_prods_custm.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,median_freq,Frequency_flag,gender,state,age,date_joined,dependants_number,family_status,income,exists
0,2539329,1,1,2,8,NaN,196.0,1.0,0.0,Soda,...,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,2,3,7,15.0,196.0,1.0,1.0,Soda,...,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,3,3,12,21.0,196.0,1.0,1.0,Soda,...,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,4,4,7,29.0,196.0,1.0,1.0,Soda,...,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,5,4,15,28.0,196.0,1.0,1.0,Soda,...,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423,both

In [33]:
df_ords_prods_custm.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404161 entries, 0 to 32404160
Data columns (total 31 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 int32
 2   order_number            int8
 3   orders_day_of_week      int8
 4   order_hour_of_day       int8
 5   days_since_prior_order  float16
 6   product_id              float16
 7   add_to_cart_order       float16
 8   reordered               float16
 9   product_name            object
 10  aisle_id                int8
 11  department_id           int8
 12  prices                  float16
 13  price_range_loc         object
 14  busiest_day             object
 15  busiest_days            object
 16  busiest_period_of_day   object
 17  max_order               int8
 18  loyalty_flag            object
 19  mean_prices             float32
 20  spender_level           object
 21  median_freq             float16
 22  Frequency_flag          object
 23  gender                  object
 24  state                   object
 25  age                     int8
 26  date_joined             object
 27  dependants_number       int8
 28  family_status           object
 29  income                  int64
 30  exists                  category
dtypes: category(1), float16(6), float32(1), int32(2), int64(1), int8(8), object(12)
memory usage: 4.4+ GB

In [35]:
#Checking value counts

df_ords_prods_custm['exists'].value_counts()

both          32404161
left_only            0
right_only           0
Name: exists, dtype: int64

In [36]:
# Checking if the merge function worked successfully

df_ords_prods_custm.shape

(32404161, 31)

In [37]:
# Export data to pkl

df_ords_prods_custm.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'opc_merged.pkl'))